SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/0J4932XFVG/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!-3086968154779790715!460362!0</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-03-09T17:16" ArrivalDateTime="2019-03-09T20:02" FlightNumber="2225" NumberInParty="1" ResBookDesigCode="G" Status="NN">      <DestinationLocation   LocationCode="ORD"/>      <Equipment AirEquipType="319"/>      <MarketingAirline Code="UA" FlightNumber="2225"/>      <OperatingAirline Code="UA"/>      <OriginLocation   LocationCode="AUS"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-09T21:30" ArrivalDateTime="2019-03-10T16:45" FlightNumber="6" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="IST"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="TK" FlightNumber="6"/>      <OperatingAirline Code="TK"/>      <OriginLocation   LocationCode="ORD"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-10T20:55" ArrivalDateTime="2019-03-11T05:15" FlightNumber="716" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="TK" FlightNumber="716"/>      <OperatingAirline Code="TK"/>      <OriginLocation   LocationCode="IST"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-04T06:15" ArrivalDateTime="2019-04-04T10:30" FlightNumber="717" NumberInParty="1" ResBookDesigCode="W" Status="NN">      <DestinationLocation   LocationCode="IST"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="TK" FlightNumber="717"/>      <OperatingAirline Code="TK"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-04T13:30" ArrivalDateTime="2019-04-04T17:25" FlightNumber="1" NumberInParty="1" ResBookDesigCode="W" Status="NN">      <DestinationLocation   LocationCode="JFK"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="TK" FlightNumber="1"/>      <OperatingAirline Code="TK"/>      <OriginLocation   LocationCode="IST"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-04T21:20" ArrivalDateTime="2019-04-05T00:42" FlightNumber="1295" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="AUS"/>      <Equipment AirEquipType="320"/>      <MarketingAirline Code="B6" FlightNumber="1295"/>      <OperatingAirline Code="B6"/>      <OriginLocation   LocationCode="JFK"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>